app/controllers/trackers_controller.rb

  def count
    tracker = Tracker.find(params[:id])
    tracker.counter +=1
    tracker.date_check = Date.today
    tracker.save
---
SELECT  "trackers".* FROM "trackers" WHERE "trackers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "trackers" SET "counter" = ?, "date_check" = ?, "updated_at" = ? WHERE "trackers"."id" = ?  [["counter", 51], ["date_check", "2018-03-06"], ["updated_at", "2018-03-06 07:19:26.965600"], ["id", 1]]

  def index
    @trackers = Tracker.where(user_id: current_user.id)
---
SELECT "trackers".* FROM "trackers" WHERE "trackers"."user_id" = ?  [["user_id", 1]]

  def create
    @tracker = current_user.trackers.build(tracker_params)

    respond_to do |format|
      if @tracker.save
---
INSERT INTO "trackers" ("Name", "description", "user_id", "counter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Name", "asd"], ["description", "asd"], ["user_id", 1], ["counter", 50], ["created_at", "2018-03-06 07:18:37.125799"], ["updated_at", "2018-03-06 07:18:37.125799"]]

  def update
    respond_to do |format|
      if @tracker.update(tracker_params)
---
UPDATE "trackers" SET "description" = ?, "updated_at" = ? WHERE "trackers"."id" = ?  [["description", "1234"], ["updated_at", "2018-03-06 07:34:30.165781"], ["id", 3]]

  def destroy
    @tracker.destroy
---
DELETE FROM "trackers" WHERE "trackers"."id" = ?  [["id", 1]]

    def set_tracker
      @tracker = Tracker.find(params[:id])
---
SELECT  "trackers".* FROM "trackers" WHERE "trackers"."id" = ? LIMIT 1  [["id", 3]]